app/Controllers/Admin.php

SELECT *
FROM `events`
ORDER BY `start_event` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE MONTH(start_event) = '04'
AND YEAR(start_event) = '2026'
SELECT COUNT(*) AS `numrows`
FROM `announcements`
SELECT *
FROM `events`
ORDER BY `start_event` ASC
 LIMIT 5
---
    public function index() {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $db = \Config\Database::connect();
        $search = trim($this->request->getGet('search') ?? '');

        $eventModel = new EventModel();
        $latestEvent = $eventModel->orderBy('start_event', 'DESC')->first();
        $current_event_id = $latestEvent ? $latestEvent['id'] : 0;

        // ✅ Count students
        $student_count = $db->table('users')
                            ->where('role', 'student')
                            ->countAllResults();

        // ✅ Count events this month
        $event_count = $db->table('events')
                          ->where('MONTH(start_event)', date('m'))
                          ->where('YEAR(start_event)', date('Y'))
                          ->countAllResults();

        // ✅ Count announcements
        $announcement_count = $db->table('announcements')->countAllResults();

        // ✅ Upcoming events for sidebar
        $upcoming_events = $eventModel->orderBy('start_event', 'ASC')
                                      ->findAll(5);

SELECT *
FROM `users`
WHERE `role` = 'student'
ORDER BY `full_name` ASC
---
    public function students() {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $db = \Config\Database::connect();
        $search = trim($this->request->getGet('search') ?? '');

        $builder = $db->table('users');
        $builder->where('role', 'student');

        if (!empty($search)) {
            $builder->groupStart()
                    ->like('full_name', $search)
                    ->orLike('id_number', $search)
                    ->groupEnd();
        }

        $data['students'] = $builder->orderBy('full_name', 'ASC')->get()->getResultArray();

SELECT *
FROM `events`
ORDER BY `start_event` DESC
 LIMIT 1
SELECT `users`.`id_number`, `users`.`full_name`, `users`.`course`, `users`.`year_level_id`, `users`.`profile_pic`, `attendance`.`time_in`, `attendance`.`time_out`, `attendance`.`status`
FROM `users`
LEFT JOIN `attendance` ON `attendance`.`student_id` = `users`.`id_number` AND `attendance`.`event_id` = 2
WHERE `users`.`role` = 'student'
ORDER BY `users`.`full_name` ASC
---
    public function check_attendance() {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $db = \Config\Database::connect();
        $eventModel = new EventModel();
        $latestEvent = $eventModel->orderBy('start_event', 'DESC')->first();
        $current_event_id = $latestEvent ? $latestEvent['id'] : 0;

        // Get specific student search if coming from view_student History button
        $search = trim($this->request->getGet('search') ?? '');

        // Join users with attendance for the latest event
        $builder = $db->table('users');
        $builder->select('users.id_number, users.full_name, users.course, users.year_level_id, users.profile_pic, attendance.time_in, attendance.time_out, attendance.status');
        $builder->join('attendance', "attendance.student_id = users.id_number AND attendance.event_id = $current_event_id", 'left');
        $builder->where('users.role', 'student');

        if (!empty($search)) {
            $builder->where('users.id_number', $search);
        }

        $builder->orderBy('users.full_name', 'ASC');

        $data = [
            'students'         => $builder->get()->getResultArray(),
            'search_query'     => $search,
            'event_name'       => $latestEvent ? $latestEvent['title'] : 'No Active Event',
            'current_event_id' => $current_event_id,
        ];

SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE MONTH(start_event) = '04'
AND YEAR(start_event) = '2026'
---
    public function events() {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $db = \Config\Database::connect();
        $eventModel = new EventModel();

        $filter = $this->request->getGet('filter') ?? 'all'; // all | month | upcoming | past

        $builder = $db->table('events')->orderBy('start_event', 'DESC');

        if ($filter === 'month') {
            $builder->where('MONTH(start_event)', date('m'))
                    ->where('YEAR(start_event)', date('Y'));
        } elseif ($filter === 'upcoming') {
            $builder->where('start_event >=', date('Y-m-d H:i:s'));
        } elseif ($filter === 'past') {
            $builder->where('start_event <', date('Y-m-d H:i:s'));
        }

        $data = [
            'events'       => $builder->get()->getResultArray(),
            'filter'       => $filter,
            'event_count'  => $db->table('events')
                                ->where('MONTH(start_event)', date('m'))
                                ->where('YEAR(start_event)', date('Y'))
                                ->countAllResults(),

SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
---
    public function announcements() {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $db = \Config\Database::connect();

        $announcements = $db->table('announcements')
                            ->orderBy('created_at', 'DESC')
                            ->get()
                            ->getResultArray();