app/Controllers/AttendanceController.php

    public function getEvents() {
        $model = new EventModel();
        $events = $model->findAll();
---
SELECT *
FROM `events`