app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `id_number` = '23-a-01647'
 LIMIT 1
---
    public function auth() {
        $session = session();
        $model = new UserModel();

        $idInput = strtolower($this->request->getVar('username'));
        $password = $this->request->getVar('password');

        $user = $model->where('id_number', $idInput)->first();