app/Controllers/Student.php

   public function index() {
    $session = session();
    if(!$session->get('isLoggedIn')) return redirect()->to(base_url('login'));

    $db = \Config\Database::connect();
    $studentId = $session->get('id_number');
    $userId = $session->get('id');

    // Fetch the full student record including email
    $student = $db->table('users')->where('id', $userId)->get()->getRowArray();

    $attendanceLogs = $db->table('attendance')
        ->select('attendance.*, events.title as event_title')
        ->join('events', 'events.id = attendance.event_id', 'left')
        ->where('student_id', $studentId)
        ->orderBy('attendance.time_in', 'DESC')
        ->get()
        ->getResultArray();

    // ADD THIS: Fetch announcements using the 'message' column from your DB
    $announcements = $db->table('announcements')
        ->orderBy('created_at', 'DESC')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `users`
WHERE `id` = '5'
SELECT `attendance`.*, `events`.`title` as `event_title`
FROM `attendance`
LEFT JOIN `events` ON `events`.`id` = `attendance`.`event_id`
WHERE `student_id` = '23-a-01647'
ORDER BY `attendance`.`time_in` DESC
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC

    public function get_calendar_events() {
        $model = new EventModel();
        $events = $model->findAll();
---
SELECT *
FROM `events`